---
kind: type
id: T:Autodesk.Revit.DB.KeynoteTable
source: html/e0fd9115-a579-bab4-31ad-542e897edc13.htm
---
# Autodesk.Revit.DB.KeynoteTable

KeynoteTable represents the collection of keynotes (KeynoteEntries) for a document.

## Syntax (C#)
```csharp
public class KeynoteTable : KeyBasedTreeEntryTable
```